<?php
// +-------------------------------------------------------------------------
// | THINKER [ Internet Ecological traffic aggregation and sharing platform ]
// +-------------------------------------------------------------------------
// | Copyright (c) 2019~2099 https://thinker.com All rights reserved.
// +-------------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +-------------------------------------------------------------------------
// | Author: yangrong <3223577520@qq.com>
// +-------------------------------------------------------------------------
// [ 核心中文语言包 ]
// --------------------------------------------------------------------------

return [
    // 系统错误提示
    'Plug in configuration file missing'                        => '缺少插件配置文件',
	'Please open the session manually'                          => '请手动打开会话',
];
