<?php
// +----------------------------------------------------------------------
// | Captcha配置文件
// +----------------------------------------------------------------------
return [
    // 默认配置
    'default' => [
        //验证码位数
        'length' => 5,
        // 验证码字符集合
        'codeSet' => '0123456789',
        // 验证码过期时间
        'expire' => 1800,
        // 是否使用中文验证码
        'useZh' => false,
        // 是否使用算术验证码
        'math' => false,
        // 是否使用背景图
        'useImgBg' => false,
        //验证码字符大小
        'fontSize' => 25,
        // 是否使用混淆曲线
        'useCurve' => true,
        //是否添加杂点
        'useNoise' => true,
        // 验证码字体 不设置则随机
        'fontttf' => '',
        //背景颜色
        'bg' => [243, 251, 254],
        // 验证码图片高度
        'imageH' => 0,
        // 验证码图片宽度
        'imageW' => 0,
    ],
    'admin_login' => [
        //
        'is_on' => 1,
        'config' => [],
    ],
    // 留言提交验证码配置
    'guestbook' => [
        //
        'is_on' => 0,
        'config' => [],
    ],
    // 会员登录验证码配置
    'users_login' => [
        //
        'is_on' => 0,
        'config' => [],
    ],
    // 会员注册验证码配置
    'users_reg' => [
        //
        'is_on' => 0,
        'config' => [],
    ],
    // 会员找回密码验证码配置
    'users_retrieve_password' => [
        //
        'is_on' => 0,
        'config' => [],
    ],
];