<?php
// +-------------------------------------------------------------------------
// | THINKER [ Internet Ecological traffic aggregation and sharing platform ]
// +-------------------------------------------------------------------------
// | Copyright (c) 2019~2099 https://thinker.com All rights reserved.
// +-------------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +-------------------------------------------------------------------------
// | Author: yangrong <3223577520@qq.com>
// +-------------------------------------------------------------------------
return [
    // 1=兼容模式+pathinfo模式，2=pathinfo+短地址模式
    'seo_pseudo' => 1,
    // 0=保留入口文件，1=隐藏入口文件
    'seo_inlet' => 0,
    // 手机域名配置
    'web_mobile_domain' => 'm',
];